Revit 2027 API
FabricationPart.HasNoConnections Method
 Checks to see if all the fabrication part's connectors are open.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasNoConnections()
Public Function HasNoConnections As Boolean
public:
bool HasNoConnections()
member HasNoConnections : unit -> bool
Return Value
Boolean
 Returns true if the part has zero connections.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace